
public class Ex00배열 {

	public static void main(String[] args) {
		
//new int [5];
// int [] arr = new int [5]; -> 배열 래퍼런스 변수선언 [] ->메모리공간을 찾아가는 주소
// arr -> 인덱스 0번에서 몇칸만큼 떨어져있는지   // [5] 메모리 공간
//정적변수 : 프로그램을 시작하자마자 선언되는 변수(위치 상관없음)
//전역변수 : 클래스 내에서 어디서든 사용가능하는 변수 (class 이름 바로 밑에 main 메서드 밖에 선언),공용
		
// 레퍼런스 변수 선언 시 배열의 크기를 저장할수 없다. int [] arr -> arr 앞 대괄호 안에 지정하면 오류
// int[] arr; 래퍼런스 변수 선언만한것이고 배열을 생성한게 아니다. -> 오류
// arr =new int[5];
// arr[0]; //arr이 가지고 있는 주소값을 가지고 배열 찾아가서 0번 인덱스 값 가지고 올래 라는 뜻
// arr[4]; //4번 인덱스 값 가지고 올래 라는 뜻
	//
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	}

}
